Revit 2027 API
BuiltInFailures.MassFailures.CannotMergeGeometry Property
 The Mass contains geometry that cannot be combined. Mass Floors, volume, and surface area, won't be computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMergeGeometry { get; }
Public Shared ReadOnly Property CannotMergeGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMergeGeometry {
	FailureDefinitionId^ get ();
}
static member CannotMergeGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace